_org/_posts/devenv/2018-07-12-git.org
#+begin_export html
---
layout: post
title:      "Git 学习"
date:       2015-07-12
categories: 研发环境
tags:
    - git
---
#+end_export

* Git

** 配置

*** 列出当前配置

    #+begin_src shell
      git config --list
    #+end_src

*** 列出 repository 配置

    #+begin_src shell
      git config --local --list
    #+end_src

*** 列出全局配置

    #+begin_src shell
      git config --global --list
    #+end_src

*** 列出系统配置

    #+begin_src shell
      git config --system --list
    #+end_src

*** 设置用户名

    #+begin_src shell
      git config --global user.name “[firstname lastname]”
    #+end_src

*** 设置用户邮箱

    #+begin_src shell
      git config --global user.email “[valid-email]”
    #+end_src

*** 设置 git 命令输出为彩色

    #+begin_src shell
      git config --global color.ui auto
    #+end_src

*** 设置 git 使用的文本编辑器设

    #+begin_src shell
      git config --global core.editor vi
    #+end_src

** 配置文件

*** Repository 配置对应的配置文件路径[--local]

    #+begin_src shell
      <repo>/.git/config
    #+end_src

*** 用户全局配置对应的配置文件路径[--global]

    #+begin_src shell
      ~/.gitconfig
    #+end_src

*** 系统配置对应的配置文件路径[--local]

    #+begin_src shell
      /etc/gitconfig
    #+end_src

** 创建

*** 复制一个已创建的仓库:

    #+begin_src shell
      # 通过 SSH
      git clone ssh://user@domain.com/repo.git
      #通过 HTTP
      git clone http://domain.com/user/repo.git
    #+end_src

*** 创建一个新的本地仓库:

    #+begin_src shell
      git init
    #+end_src

** 本地修改

*** 显示工作路径下已修改的文件

    #+begin_src shell
      git status
    #+end_src

*** 显示与上次提交版本文件的不同

    #+begin_src shell
      git diff
    #+end_src

*** 把当前所有修改添加到下次提交中

    #+begin_src shell
      git add .
    #+end_src

*** 把对某个文件的修改添加到下次提交中

    #+begin_src shell
      git add -p <file>
    #+end_src

*** 提交本地的所有修改

    #+begin_src shell
      git commit -a
    #+end_src

*** 提交之前已标记的变化

    #+begin_src shell
      git commit
    #+end_src

*** 附加消息提交

    #+begin_src shell
      git commit -m 'message here'
    #+end_src

*** 提交，并将提交时间设置为之前的某个日期:

    #+begin_src shell
      git commit --date="`date --date='n day ago'`" -am "Commit Message"
    #+end_src

*** 修改上次提交

    =请勿修改已发布的提交记录!=

    #+begin_src shell
      git commit --amend
    #+end_src

*** 修改上次提交的 committer date

    #+begin_src shell
      GIT_COMMITTER_DATE="date" git commit --amend
    #+end_src

*** 修改上次提交的 author date

    #+begin_src shell
      git commit --amend --date="date"
    #+end_src

*** 把当前分支中未提交的修改移动到其他分支

    #+begin_src shell
      git stash
      git checkout branch2
      git stash pop
    #+end_src

*** 将 stashed changes 应用到当前分支

    #+begin_src shell
      git stash apply
    #+end_src

*** 删除最新一次的 stashed changes

    #+begin_src shell
      git stash drop
    #+end_src

** 搜索

*** 从当前目录的所有文件中查找文本内容

    #+begin_src shell
      git grep "Hello"
    #+end_src

*** 在某一版本中搜索文本

    #+begin_src shell
      git grep "Hello" v2.5
    #+end_src

** 提交历史

*** 从最新提交开始，显示所有的提交记录（显示 hash， 作者信息，提交的标题和时间）

    #+begin_src shell
      git log
    #+end_src

*** 显示所有提交（仅显示提交的 hash 和 message）

    #+begin_src shell
      git log --oneline
    #+end_src

*** 显示某个用户的所有提交

    #+begin_src shell
      git log --author="username"
    #+end_src

*** 显示某个文件的所有修改

    #+begin_src shell
      git log -p <file>
    #+end_src

*** 仅显示远端<remote/master>分支与远端<origin/master>分支提交记录的差集

    #+begin_src shell
      git log --oneline <origin/master>..<remote/master> --left-right
    #+end_src

*** 谁，在什么时间，修改了文件的什么内容

    #+begin_src shell
      git blame <file>
    #+end_src

*** 显示 reflog

    #+begin_src shell
      git reflog show
    #+end_src

*** 删除 reflog

    #+begin_src shell
      git reflog delete
    #+end_src

** 分支与标签

*** 列出所有的分支

    #+begin_src shell
      git branch
    #+end_src

*** 列出所有的远端分支

    #+begin_src shell
      git branch -r
    #+end_src

*** 切换分支

    #+begin_src shell
      git checkout <branch>
    #+end_src

