_posts/devenv/2018-07-12-git.html
---
layout: post
title:      "Git 学习"
date:       2015-07-12
categories: 研发环境
tags:
    - git
---

<div id="outline-container-org56acd03" class="outline-2">
<h2 id="org56acd03">Git</h2>
<div class="outline-text-2" id="text-org56acd03">
</div>
<div id="outline-container-org606325b" class="outline-3">
<h3 id="org606325b">配置</h3>
<div class="outline-text-3" id="text-org606325b">
</div>
<div id="outline-container-org9942c46" class="outline-4">
<h4 id="org9942c46">列出当前配置</h4>
<div class="outline-text-4" id="text-org9942c46">
<div class="org-src-container">
<pre class="src src-shell">git config --list
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd9ccfdf" class="outline-4">
<h4 id="orgd9ccfdf">列出 repository 配置</h4>
<div class="outline-text-4" id="text-orgd9ccfdf">
<div class="org-src-container">
<pre class="src src-shell">git config --local --list
</pre>
</div>
</div>
</div>

<div id="outline-container-org1151411" class="outline-4">
<h4 id="org1151411">列出全局配置</h4>
<div class="outline-text-4" id="text-org1151411">
<div class="org-src-container">
<pre class="src src-shell">git config --global --list
</pre>
</div>
</div>
</div>

<div id="outline-container-org41219c9" class="outline-4">
<h4 id="org41219c9">列出系统配置</h4>
<div class="outline-text-4" id="text-org41219c9">
<div class="org-src-container">
<pre class="src src-shell">git config --system --list
</pre>
</div>
</div>
</div>

<div id="outline-container-org4307ae2" class="outline-4">
<h4 id="org4307ae2">设置用户名</h4>
<div class="outline-text-4" id="text-org4307ae2">
<div class="org-src-container">
<pre class="src src-shell">git config --global user.name &#8220;<span style="color: #4f97d7;">[</span>firstname lastname<span style="color: #4f97d7;">]</span>&#8221;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgebdec18" class="outline-4">
<h4 id="orgebdec18">设置用户邮箱</h4>
<div class="outline-text-4" id="text-orgebdec18">
<div class="org-src-container">
<pre class="src src-shell">git config --global user.email &#8220;<span style="color: #4f97d7;">[</span>valid-email<span style="color: #4f97d7;">]</span>&#8221;
</pre>
</div>
</div>
</div>

<div id="outline-container-org9c370ee" class="outline-4">
<h4 id="org9c370ee">设置 git 命令输出为彩色</h4>
<div class="outline-text-4" id="text-org9c370ee">
<div class="org-src-container">
<pre class="src src-shell">git config --global color.ui auto
</pre>
</div>
</div>
</div>

<div id="outline-container-orgef0ed62" class="outline-4">
<h4 id="orgef0ed62">设置 git 使用的文本编辑器设</h4>
<div class="outline-text-4" id="text-orgef0ed62">
<div class="org-src-container">
<pre class="src src-shell">git config --global core.editor vi
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4a3c626" class="outline-3">
<h3 id="org4a3c626">配置文件</h3>
<div class="outline-text-3" id="text-org4a3c626">
</div>
<div id="outline-container-orga56e78a" class="outline-4">
<h4 id="orga56e78a">Repository 配置对应的配置文件路径[&#x2013;local]</h4>
<div class="outline-text-4" id="text-orga56e78a">
<div class="org-src-container">
<pre class="src src-shell">&lt;repo&gt;/.git/config
</pre>
</div>
</div>
</div>

<div id="outline-container-org31ce932" class="outline-4">
<h4 id="org31ce932">用户全局配置对应的配置文件路径[&#x2013;global]</h4>
<div class="outline-text-4" id="text-org31ce932">
<div class="org-src-container">
<pre class="src src-shell">~/.gitconfig
</pre>
</div>
</div>
</div>

<div id="outline-container-org3f37ff9" class="outline-4">
<h4 id="org3f37ff9">系统配置对应的配置文件路径[&#x2013;local]</h4>
<div class="outline-text-4" id="text-org3f37ff9">
<div class="org-src-container">
<pre class="src src-shell">/etc/gitconfig
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc510852" class="outline-3">
<h3 id="orgc510852">创建</h3>
<div class="outline-text-3" id="text-orgc510852">
</div>
<div id="outline-container-orgd8543f3" class="outline-4">
<h4 id="orgd8543f3">复制一个已创建的仓库:</h4>
<div class="outline-text-4" id="text-orgd8543f3">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#36890;&#36807; SSH</span>
git clone ssh://user@domain.com/repo.git
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#36890;&#36807; HTTP</span>
git clone http://domain.com/user/repo.git
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd1eaf99" class="outline-4">
<h4 id="orgd1eaf99">创建一个新的本地仓库:</h4>
<div class="outline-text-4" id="text-orgd1eaf99">
<div class="org-src-container">
<pre class="src src-shell">git init
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge606b4a" class="outline-3">
<h3 id="orge606b4a">本地修改</h3>
<div class="outline-text-3" id="text-orge606b4a">
</div>
<div id="outline-container-org0632bb5" class="outline-4">
<h4 id="org0632bb5">显示工作路径下已修改的文件</h4>
<div class="outline-text-4" id="text-org0632bb5">
<div class="org-src-container">
<pre class="src src-shell">git status
</pre>
</div>
</div>
</div>

<div id="outline-container-org4c80182" class="outline-4">
<h4 id="org4c80182">显示与上次提交版本文件的不同</h4>
<div class="outline-text-4" id="text-org4c80182">
<div class="org-src-container">
<pre class="src src-shell">git diff
</pre>
</div>
</div>
</div>

<div id="outline-container-org9f199f4" class="outline-4">
<h4 id="org9f199f4">把当前所有修改添加到下次提交中</h4>
<div class="outline-text-4" id="text-org9f199f4">
<div class="org-src-container">
<pre class="src src-shell">git add .
</pre>
</div>
</div>
</div>

<div id="outline-container-org19cb34b" class="outline-4">
<h4 id="org19cb34b">把对某个文件的修改添加到下次提交中</h4>
<div class="outline-text-4" id="text-org19cb34b">
<div class="org-src-container">
<pre class="src src-shell">git add -p &lt;file&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org561f6f8" class="outline-4">
<h4 id="org561f6f8">提交本地的所有修改</h4>
<div class="outline-text-4" id="text-org561f6f8">
<div class="org-src-container">
<pre class="src src-shell">git commit -a
</pre>
</div>
</div>
</div>

<div id="outline-container-org2a30ecd" class="outline-4">
<h4 id="org2a30ecd">提交之前已标记的变化</h4>
<div class="outline-text-4" id="text-org2a30ecd">
<div class="org-src-container">
<pre class="src src-shell">git commit
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd81c167" class="outline-4">
<h4 id="orgd81c167">附加消息提交</h4>
<div class="outline-text-4" id="text-orgd81c167">
<div class="org-src-container">
<pre class="src src-shell">git commit -m <span style="color: #2d9574;">'message here'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b60364" class="outline-4">
<h4 id="org8b60364">提交，并将提交时间设置为之前的某个日期:</h4>
<div class="outline-text-4" id="text-org8b60364">
<div class="org-src-container">
<pre class="src src-shell">git commit --date=<span style="color: #2d9574;">"`date --date='n day ago'`"</span> -am <span style="color: #2d9574;">"Commit Message"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb12ea07" class="outline-4">
<h4 id="orgb12ea07">修改上次提交</h4>
<div class="outline-text-4" id="text-orgb12ea07">
<p>
<code>请勿修改已发布的提交记录!</code>
</p>

<div class="org-src-container">
<pre class="src src-shell">git commit --amend
</pre>
</div>
</div>
</div>

<div id="outline-container-org2661775" class="outline-4">
<h4 id="org2661775">修改上次提交的 committer date</h4>
<div class="outline-text-4" id="text-org2661775">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #7590db;">GIT_COMMITTER_DATE</span>=<span style="color: #2d9574;">"date"</span> git commit --amend
</pre>
</div>
</div>
</div>

<div id="outline-container-org193e609" class="outline-4">
<h4 id="org193e609">修改上次提交的 author date</h4>
<div class="outline-text-4" id="text-org193e609">
<div class="org-src-container">
<pre class="src src-shell">git commit --amend --date=<span style="color: #2d9574;">"date"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9f59499" class="outline-4">
<h4 id="org9f59499">把当前分支中未提交的修改移动到其他分支</h4>
<div class="outline-text-4" id="text-org9f59499">
<div class="org-src-container">
<pre class="src src-shell">git stash
git checkout branch2
git stash pop
</pre>
</div>
</div>
</div>

<div id="outline-container-org998016f" class="outline-4">
<h4 id="org998016f">将 stashed changes 应用到当前分支</h4>
<div class="outline-text-4" id="text-org998016f">
<div class="org-src-container">
<pre class="src src-shell">git stash apply
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc78897a" class="outline-4">
<h4 id="orgc78897a">删除最新一次的 stashed changes</h4>
<div class="outline-text-4" id="text-orgc78897a">
<div class="org-src-container">
<pre class="src src-shell">git stash drop
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org43f280a" class="outline-3">
<h3 id="org43f280a">搜索</h3>
<div class="outline-text-3" id="text-org43f280a">
</div>
<div id="outline-container-org82bd2d9" class="outline-4">
<h4 id="org82bd2d9">从当前目录的所有文件中查找文本内容</h4>
<div class="outline-text-4" id="text-org82bd2d9">
<div class="org-src-container">
<pre class="src src-shell">git grep <span style="color: #2d9574;">"Hello"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org94630f2" class="outline-4">
<h4 id="org94630f2">在某一版本中搜索文本</h4>
<div class="outline-text-4" id="text-org94630f2">
<div class="org-src-container">
<pre class="src src-shell">git grep <span style="color: #2d9574;">"Hello"</span> v2.5
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc5aaa2c" class="outline-3">
<h3 id="orgc5aaa2c">提交历史</h3>
<div class="outline-text-3" id="text-orgc5aaa2c">
</div>
<div id="outline-container-orgdcf6b0b" class="outline-4">
<h4 id="orgdcf6b0b">从最新提交开始，显示所有的提交记录（显示 hash， 作者信息，提交的标题和时间）</h4>
<div class="outline-text-4" id="text-orgdcf6b0b">
<div class="org-src-container">
<pre class="src src-shell">git log
</pre>
</div>
</div>
</div>

<div id="outline-container-orge6f6dc8" class="outline-4">
<h4 id="orge6f6dc8">显示所有提交（仅显示提交的 hash 和 message）</h4>
<div class="outline-text-4" id="text-orge6f6dc8">
<div class="org-src-container">
<pre class="src src-shell">git log --oneline
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c71a74" class="outline-4">
<h4 id="org8c71a74">显示某个用户的所有提交</h4>
<div class="outline-text-4" id="text-org8c71a74">
<div class="org-src-container">
<pre class="src src-shell">git log --author=<span style="color: #2d9574;">"username"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgec88601" class="outline-4">
<h4 id="orgec88601">显示某个文件的所有修改</h4>
<div class="outline-text-4" id="text-orgec88601">
<div class="org-src-container">
<pre class="src src-shell">git log -p &lt;file&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org5043d90" class="outline-4">
<h4 id="org5043d90">仅显示远端&lt;remote/master&gt;分支与远端&lt;origin/master&gt;分支提交记录的差集</h4>
<div class="outline-text-4" id="text-org5043d90">
<div class="org-src-container">
<pre class="src src-shell">git log --oneline &lt;origin/master&gt;..&lt;remote/master&gt; --left-right
</pre>
</div>
</div>
</div>

<div id="outline-container-org2499ae2" class="outline-4">
<h4 id="org2499ae2">谁，在什么时间，修改了文件的什么内容</h4>
<div class="outline-text-4" id="text-org2499ae2">
<div class="org-src-container">
<pre class="src src-shell">git blame &lt;file&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org53925c1" class="outline-4">
<h4 id="org53925c1">显示 reflog</h4>
<div class="outline-text-4" id="text-org53925c1">
<div class="org-src-container">
<pre class="src src-shell">git reflog show
</pre>
</div>
</div>
</div>

<div id="outline-container-org02f2b9c" class="outline-4">
<h4 id="org02f2b9c">删除 reflog</h4>
<div class="outline-text-4" id="text-org02f2b9c">
<div class="org-src-container">
<pre class="src src-shell">git reflog delete
</pre>
</div>
</div>
</div>
</div>
