_org/_posts/devenv/2018-07-12-git.org
*** 创建并切换到新分支

    #+begin_src shell
      git checkout -b <branch>
    #+end_src

*** 基于当前分支创建新分支

    #+begin_src shell
      git branch <new-branch>
    #+end_src

*** 基于远程分支创建新的可追溯的分支

    #+begin_src shell
      git branch --track <new-branch> <remote-branch>
    #+end_src

*** 删除本地分支

    #+begin_src shell
      git branch -d <branch>
    #+end_src

*** 强制删除一个本地分支

    =将会丢失未合并的修改！=

    #+begin_src shell
      git branch -D <branch>
    #+end_src

*** 查看标签

    #+begin_src shell
      git tag
      git tag -l 'v0.1.-'
      git show v0.1
    #+end_src

*** 给当前版本打标签

    #+begin_src shell
      git tag <tag-name>
    #+end_src

*** 给当前版本打标签并附加消息

    #+begin_src shell
      git tag -a <tag-name>
      git tag -a <tag-name> -m 'my version'
    #+end_src

** 更新与发布

*** 列出当前配置的远程端

    #+begin_src shell
      git remote -v
    #+end_src

*** 显示远程端的信息

    #+begin_src shell
      git remote show <remote>
    #+end_src

*** 添加新的远程端

    #+begin_src shell
      git remote add <remote> <url>
    #+end_src

*** 下载远程端版本，但不合并到 HEAD 中

    #+begin_src shell
      git fetch <remote>
    #+end_src

*** 下载远程端版本，并自动与 HEAD 版本合并

    #+begin_src shell
      git remote pull <remote> <url>
    #+end_src

*** 将远程端版本合并到本地版本中

    #+begin_src shell
      git pull origin master
    #+end_src

*** 以 rebase 方式将远端分支与本地合并

    #+begin_src shell
      git pull --rebase <remote> <branch>
    #+end_src

*** 将本地版本发布到远程端

    #+begin_src shell
      git push remote <remote> <branch>
    #+end_src

*** 删除远程端分支

    #+begin_src shell
      git push <remote> :<branch> (since Git v1.5.0)
      # 或者
      git push <remote> --delete <branch> (since Git v1.7.0)
    #+end_src

*** 发布标签:

    #+begin_src shell
      git push --tags
    #+end_src

** 合并与重置(Rebase)

*** 将分支合并到当前 HEAD 中

    #+begin_src shell
      git merge <branch>
    #+end_src

*** 将当前 HEAD 版本重置到分支中

    =请勿重置已发布的提交!=

    #+begin_src shell
      git rebase <branch>
    #+end_src

*** 退出重置

    #+begin_src shell
      git rebase --abort
    #+end_src

*** 解决冲突后继续重置

    #+begin_src shell
      git rebase --continue
    #+end_src

*** 使用配置好的 merge tool 解决冲突

    #+begin_src shell
      git mergetool
    #+end_src

*** 在编辑器中手动解决冲突后，标记文件为 `已解决冲突`

    #+begin_src shell
      git add <resolved-file>
      git rm <resolved-file>
    #+end_src

*** 合并提交

    #+begin_src shell
      git rebase -i <commit-just-before-first>
    #+end_src

    把下面两段命令的上段内容替换为下段内容

    =原内容=
    #+begin_src shell
      pick <commit_id>
      pick <commit_id2>
      pick <commit_id3>
    #+end_src

    =替换为=
    #+begin_src shell
      pick <commit_id>
      squash <commit_id2>
      squash <commit_id3>
    #+end_src

** 撤销

*** 放弃工作目录下的所有修改

    #+begin_src shell
      git reset --hard HEAD
    #+end_src

*** 移除缓存区的所有文件（i.e. 撤销上次 `git add`）

    #+begin_src shell
      git reset HEAD
    #+end_src

*** 放弃某个文件的所有本地修改

    #+begin_src shell
      git checkout HEAD <file>
    #+end_src

*** 重置一个提交（通过创建一个截然不同的新提交）

    #+begin_src shell
      git revert <commit>
    #+end_src

*** 将 HEAD 重置到指定的版本，并抛弃该版本之后的所有修改

    #+begin_src shell
      git reset --hard <commit>
    #+end_src

*** 用远端分支强制覆盖本地分支

    #+begin_src shell
      git reset --hard <remote/branch> e.g., upstream/master, origin/my-feature
    #+end_src

*** 将 HEAD 重置到上一次提交的版本，并将之后的修改标记为未添加到缓存区的修改

    #+begin_src shell
      git reset <commit>
    #+end_src

*** 将 HEAD 重置到上一次提交的版本，并保留未提交的本地修改

    #+begin_src shell
      git reset --keep <commit>
    #+end_src

*** 删除添加`.gitignore`文件前错误提交的文件

    #+begin_src shell
      git rm -r --cached .
      git add .
      git commit -m "remove xyz file"
    #+end_src

* Git-Flow

** 安装

   - 你需要有一个可以工作的 git 作为前提。
   - Git flow 可以工作在 OSX, Linux 和 Windows 之下

