_posts/devenv/2018-07-12-git.html

<div id="outline-container-org0834a2e" class="outline-3">
<h3 id="org0834a2e">分支与标签</h3>
<div class="outline-text-3" id="text-org0834a2e">
</div>
<div id="outline-container-org7baaccf" class="outline-4">
<h4 id="org7baaccf">列出所有的分支</h4>
<div class="outline-text-4" id="text-org7baaccf">
<div class="org-src-container">
<pre class="src src-shell">git branch
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd959edc" class="outline-4">
<h4 id="orgd959edc">列出所有的远端分支</h4>
<div class="outline-text-4" id="text-orgd959edc">
<div class="org-src-container">
<pre class="src src-shell">git branch -r
</pre>
</div>
</div>
</div>

<div id="outline-container-org2141cb4" class="outline-4">
<h4 id="org2141cb4">切换分支</h4>
<div class="outline-text-4" id="text-org2141cb4">
<div class="org-src-container">
<pre class="src src-shell">git checkout &lt;branch&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org968a26e" class="outline-4">
<h4 id="org968a26e">创建并切换到新分支</h4>
<div class="outline-text-4" id="text-org968a26e">
<div class="org-src-container">
<pre class="src src-shell">git checkout -b &lt;branch&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org06e5bbe" class="outline-4">
<h4 id="org06e5bbe">基于当前分支创建新分支</h4>
<div class="outline-text-4" id="text-org06e5bbe">
<div class="org-src-container">
<pre class="src src-shell">git branch &lt;new-branch&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orga35a68b" class="outline-4">
<h4 id="orga35a68b">基于远程分支创建新的可追溯的分支</h4>
<div class="outline-text-4" id="text-orga35a68b">
<div class="org-src-container">
<pre class="src src-shell">git branch --track &lt;new-branch&gt; &lt;remote-branch&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org1cc8d5f" class="outline-4">
<h4 id="org1cc8d5f">删除本地分支</h4>
<div class="outline-text-4" id="text-org1cc8d5f">
<div class="org-src-container">
<pre class="src src-shell">git branch -d &lt;branch&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c87ae7" class="outline-4">
<h4 id="org8c87ae7">强制删除一个本地分支</h4>
<div class="outline-text-4" id="text-org8c87ae7">
<p>
<code>将会丢失未合并的修改！</code>
</p>

<div class="org-src-container">
<pre class="src src-shell">git branch -D &lt;branch&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd9ec10a" class="outline-4">
<h4 id="orgd9ec10a">查看标签</h4>
<div class="outline-text-4" id="text-orgd9ec10a">
<div class="org-src-container">
<pre class="src src-shell">git tag
git tag -l <span style="color: #2d9574;">'v0.1.-'</span>
git show v0.1
</pre>
</div>
</div>
</div>

<div id="outline-container-orga015f83" class="outline-4">
<h4 id="orga015f83">给当前版本打标签</h4>
<div class="outline-text-4" id="text-orga015f83">
<div class="org-src-container">
<pre class="src src-shell">git tag &lt;tag-name&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org4c24c69" class="outline-4">
<h4 id="org4c24c69">给当前版本打标签并附加消息</h4>
<div class="outline-text-4" id="text-org4c24c69">
<div class="org-src-container">
<pre class="src src-shell">git tag -a &lt;tag-name&gt;
git tag -a &lt;tag-name&gt; -m <span style="color: #2d9574;">'my version'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9fe4cda" class="outline-3">
<h3 id="org9fe4cda">更新与发布</h3>
<div class="outline-text-3" id="text-org9fe4cda">
</div>
<div id="outline-container-orgf1dcdaf" class="outline-4">
<h4 id="orgf1dcdaf">列出当前配置的远程端</h4>
<div class="outline-text-4" id="text-orgf1dcdaf">
<div class="org-src-container">
<pre class="src src-shell">git remote -v
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf690f56" class="outline-4">
<h4 id="orgf690f56">显示远程端的信息</h4>
<div class="outline-text-4" id="text-orgf690f56">
<div class="org-src-container">
<pre class="src src-shell">git remote show &lt;remote&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb65fea2" class="outline-4">
<h4 id="orgb65fea2">添加新的远程端</h4>
<div class="outline-text-4" id="text-orgb65fea2">
<div class="org-src-container">
<pre class="src src-shell">git remote add &lt;remote&gt; &lt;url&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeb781b7" class="outline-4">
<h4 id="orgeb781b7">下载远程端版本，但不合并到 HEAD 中</h4>
<div class="outline-text-4" id="text-orgeb781b7">
<div class="org-src-container">
<pre class="src src-shell">git fetch &lt;remote&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd5c5ad6" class="outline-4">
<h4 id="orgd5c5ad6">下载远程端版本，并自动与 HEAD 版本合并</h4>
<div class="outline-text-4" id="text-orgd5c5ad6">
<div class="org-src-container">
<pre class="src src-shell">git remote pull &lt;remote&gt; &lt;url&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org3591846" class="outline-4">
<h4 id="org3591846">将远程端版本合并到本地版本中</h4>
<div class="outline-text-4" id="text-org3591846">
<div class="org-src-container">
<pre class="src src-shell">git pull origin master
</pre>
</div>
</div>
</div>

<div id="outline-container-org2f30f42" class="outline-4">
<h4 id="org2f30f42">以 rebase 方式将远端分支与本地合并</h4>
<div class="outline-text-4" id="text-org2f30f42">
<div class="org-src-container">
<pre class="src src-shell">git pull --rebase &lt;remote&gt; &lt;branch&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org95d33af" class="outline-4">
<h4 id="org95d33af">将本地版本发布到远程端</h4>
<div class="outline-text-4" id="text-org95d33af">
<div class="org-src-container">
<pre class="src src-shell">git push remote &lt;remote&gt; &lt;branch&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b08424" class="outline-4">
<h4 id="org7b08424">删除远程端分支</h4>
<div class="outline-text-4" id="text-org7b08424">
<div class="org-src-container">
<pre class="src src-shell">git push &lt;remote&gt; :&lt;branch&gt; <span style="color: #4f97d7;">(</span>since Git v1.5.0<span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#25110;&#32773;</span>
git push &lt;remote&gt; --delete &lt;branch&gt; <span style="color: #4f97d7;">(</span>since Git v1.7.0<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7509be0" class="outline-4">
<h4 id="org7509be0">发布标签:</h4>
<div class="outline-text-4" id="text-org7509be0">
<div class="org-src-container">
<pre class="src src-shell">git push --tags
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org69b242c" class="outline-3">
<h3 id="org69b242c">合并与重置(Rebase)</h3>
<div class="outline-text-3" id="text-org69b242c">
</div>
<div id="outline-container-orgab12eee" class="outline-4">
<h4 id="orgab12eee">将分支合并到当前 HEAD 中</h4>
<div class="outline-text-4" id="text-orgab12eee">
<div class="org-src-container">
<pre class="src src-shell">git merge &lt;branch&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc86cb51" class="outline-4">
<h4 id="orgc86cb51">将当前 HEAD 版本重置到分支中</h4>
<div class="outline-text-4" id="text-orgc86cb51">
<p>
<code>请勿重置已发布的提交!</code>
</p>

<div class="org-src-container">
<pre class="src src-shell">git rebase &lt;branch&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcb54bae" class="outline-4">
<h4 id="orgcb54bae">退出重置</h4>
<div class="outline-text-4" id="text-orgcb54bae">
<div class="org-src-container">
<pre class="src src-shell">git rebase --abort
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbbd5029" class="outline-4">
<h4 id="orgbbd5029">解决冲突后继续重置</h4>
<div class="outline-text-4" id="text-orgbbd5029">
<div class="org-src-container">
<pre class="src src-shell">git rebase --continue
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad16cef" class="outline-4">
<h4 id="orgad16cef">使用配置好的 merge tool 解决冲突</h4>
<div class="outline-text-4" id="text-orgad16cef">
<div class="org-src-container">
<pre class="src src-shell">git mergetool
</pre>
</div>
</div>
</div>

<div id="outline-container-org07d28ba" class="outline-4">
<h4 id="org07d28ba">在编辑器中手动解决冲突后，标记文件为 `已解决冲突`</h4>
<div class="outline-text-4" id="text-org07d28ba">
<div class="org-src-container">
<pre class="src src-shell">git add &lt;resolved-file&gt;
git rm &lt;resolved-file&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd597e8" class="outline-4">
<h4 id="orgcd597e8">合并提交</h4>
<div class="outline-text-4" id="text-orgcd597e8">
<div class="org-src-container">
<pre class="src src-shell">git rebase -i &lt;commit-just-before-first&gt;
</pre>
</div>

<p>
把下面两段命令的上段内容替换为下段内容
</p>

<p>
<code>原内容</code>
</p>
<div class="org-src-container">
<pre class="src src-shell">pick &lt;commit_id&gt;
pick &lt;commit_id2&gt;
pick &lt;commit_id3&gt;
</pre>
</div>

<p>
<code>替换为</code>
</p>
<div class="org-src-container">
<pre class="src src-shell">pick &lt;commit_id&gt;
squash &lt;commit_id2&gt;
squash &lt;commit_id3&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2ebb4a0" class="outline-3">
<h3 id="org2ebb4a0">撤销</h3>
<div class="outline-text-3" id="text-org2ebb4a0">
</div>
<div id="outline-container-org17bd98e" class="outline-4">
<h4 id="org17bd98e">放弃工作目录下的所有修改</h4>
<div class="outline-text-4" id="text-org17bd98e">
<div class="org-src-container">
<pre class="src src-shell">git reset --hard HEAD
</pre>
</div>
</div>
</div>

<div id="outline-container-org6842267" class="outline-4">
<h4 id="org6842267">移除缓存区的所有文件（i.e. 撤销上次 `git add`）</h4>
<div class="outline-text-4" id="text-org6842267">
<div class="org-src-container">
<pre class="src src-shell">git reset HEAD
</pre>
</div>
</div>
</div>

<div id="outline-container-orge095d2c" class="outline-4">
<h4 id="orge095d2c">放弃某个文件的所有本地修改</h4>
<div class="outline-text-4" id="text-orge095d2c">
<div class="org-src-container">
<pre class="src src-shell">git checkout HEAD &lt;file&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org5d31b69" class="outline-4">
<h4 id="org5d31b69">重置一个提交（通过创建一个截然不同的新提交）</h4>
<div class="outline-text-4" id="text-org5d31b69">
<div class="org-src-container">
<pre class="src src-shell">git revert &lt;commit&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org24c4fab" class="outline-4">
<h4 id="org24c4fab">将 HEAD 重置到指定的版本，并抛弃该版本之后的所有修改</h4>
<div class="outline-text-4" id="text-org24c4fab">
<div class="org-src-container">
<pre class="src src-shell">git reset --hard &lt;commit&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgea23253" class="outline-4">
<h4 id="orgea23253">用远端分支强制覆盖本地分支</h4>
<div class="outline-text-4" id="text-orgea23253">
<div class="org-src-container">
<pre class="src src-shell">git reset --hard &lt;remote/branch&gt; e.g., upstream/master, origin/my-feature
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc5fe23b" class="outline-4">
<h4 id="orgc5fe23b">将 HEAD 重置到上一次提交的版本，并将之后的修改标记为未添加到缓存区的修改</h4>
<div class="outline-text-4" id="text-orgc5fe23b">
<div class="org-src-container">
<pre class="src src-shell">git reset &lt;commit&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org3950289" class="outline-4">
<h4 id="org3950289">将 HEAD 重置到上一次提交的版本，并保留未提交的本地修改</h4>
<div class="outline-text-4" id="text-org3950289">
<div class="org-src-container">
<pre class="src src-shell">git reset --keep &lt;commit&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb2d3861" class="outline-4">
<h4 id="orgb2d3861">删除添加`.gitignore`文件前错误提交的文件</h4>
<div class="outline-text-4" id="text-orgb2d3861">
<div class="org-src-container">
<pre class="src src-shell">git rm -r --cached .
git add .
git commit -m <span style="color: #2d9574;">"remove xyz file"</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdb8ddec" class="outline-2">
<h2 id="orgdb8ddec">Git-Flow</h2>
<div class="outline-text-2" id="text-orgdb8ddec">
</div>
<div id="outline-container-orge9f56f8" class="outline-3">
<h3 id="orge9f56f8">安装</h3>
<div class="outline-text-3" id="text-orge9f56f8">
<ul class="org-ul">
<li>你需要有一个可以工作的 git 作为前提。</li>
<li>Git flow 可以工作在 OSX, Linux 和 Windows 之下</li>
</ul>
</div>
