_org/_posts/devenv/2018-07-12-git.org
*** OSX Homebrew:

    #+begin_src shell
      brew install git-flow
    #+end_src

*** OSX Macports:

    #+begin_src shell
      port install git-flow
    #+end_src

*** Linux

    #+begin_src shell
      apt-get install git-flow
    #+end_src

*** Windows (Cygwin)

    安装 git-flow, 你需要 wget 和 util-linux。

    #+begin_src shell
      wget -q -O - --no-check-certificate https://github.com/nvie/gitflow/raw/develop/contrib/gitflow-installer.sh | bash
    #+end_src

** 开始

   - 为了自定义你的项目，Git flow 需要初始化过程。
   - 使用 git-flow，从初始化一个现有的 git 库内开始。

*** 创建本地新的 dev 分支

    #+begin_src shell
      git branch dev  # 创建本地分支
      git branch  # 查看分支
      # 这是会看到 master 和 dev，而且 master 上会有一个星号
      # 这个时候 dev 是一个本地分支，远程仓库不知道它的存在
      # 本地分支可以不同步到远程仓库，我们可以在 dev 开发，然后 merge 到 master，
      # 使用 master 同步代码，当然也可以同步
    #+end_src

*** 发布 dev 分支

    发布 dev 分支指的是同步 dev 分支的代码到远程服务器

    #+begin_src shell
      git push origin dev:dev  # 这样远程仓库也有一个 dev 分支了
    #+end_src

*** 在 dev 分支开发代码

    #+begin_src shell
      git checkout dev  # 切换到 dev 分支进行开发
      # 开发代码之后，我们有两个选择
      # 第一个：如果功能开发完成了，可以合并主分支
      git checkout master  # 切换到主分支
      git merge dev  # 把 dev 分支的更改和 master 合并
      git push  # 提交主分支代码远程
      git checkout dev  # 切换到 dev 远程分支
      git push  # 提交 dev 分支到远程
      # 第二个：如果功能没有完成，可以直接推送
      git push  # 提交到 dev 远程分支
      # 注意：在分支切换之前最好先 commit 全部的改变，除非你真的知道自己在做什么
    #+end_src

*** 删除分支

    #+begin_src shell
      # 删除远程 dev 分支，危险命令哦
      git push origin --delete <branchName>
      # 可以使用这种语法，推送一个空分支到远程分支，其实就相当于删除远程分支
      git push origin :dev
      # 下面两条是删除本地分支
      git checkout master  # 切换到 master 分支
      git branch -d dev  # 删除本地 dev 分支
    #+end_src

** 追踪分支

   追踪分支是用与联系本地分支和远程分支的. 如果你在追踪分支(Tracking Branches)上执行推送(push)或拉取(pull)时,　它会自动推送(push)或拉取(pull)到关联的远程分支上。

   如果你经常要从远程仓库里拉取(pull)分支到本地,并且不想很麻烦的使用 `git pull` 这种格式; 那么就应当使用追踪分支(Tracking Branches)。

   `git clone` 命令会自动在本地建立一个 master 分支，它是 origin/master 的追踪分支。 而 origin/master 就是被克隆(clone)仓库的'master'分支。

   译者注: origin 一般是指原始仓库地址的别名。

   可以在使用 `git branch` 命令时加上 `--track` 参数, 来手动创建一个追踪分支。

   #+begin_src shell
     git branch --track experimental origin/experimental
     # 或者
     git checkout --track origin/experimental
   #+end_src

   当你运行下命令时:

   #+begin_src shell
     git pull experimental
   #+end_src

   它会自动从 `origin` 抓取(fetch)内容，再把远程的 `origin/experimental` 分支合并进(merge)本地的 experimental 分支。

   当要把修改推送(push)到 origin 时, 它会将你本地的 experimental 分支中的修改推送到 origin 的 experimental 分支里,　而无需指定它(origin)。


* Tips

** 查看某文件的修改历史 **

   先进入此文件所在的目录下

   1. 查看 fileName 相关的 commit 记录：`git log filename`
   2. 显示每次提交的 diff：`git log -p filename`
   3. 查看某次提交中的某个文件变化，可以直接加上 fileName：`git show commit-id filename`
   4. 根据 commit-id 查看某个提交：`git show -s --pretty=raw ca53e82`

