_posts/devenv/2018-07-12-git.html

<div id="outline-container-orge9b91b2" class="outline-4">
<h4 id="orge9b91b2">OSX Homebrew:</h4>
<div class="outline-text-4" id="text-orge9b91b2">
<div class="org-src-container">
<pre class="src src-shell">brew install git-flow
</pre>
</div>
</div>
</div>

<div id="outline-container-org5baf144" class="outline-4">
<h4 id="org5baf144">OSX Macports:</h4>
<div class="outline-text-4" id="text-org5baf144">
<div class="org-src-container">
<pre class="src src-shell">port install git-flow
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfa11d10" class="outline-4">
<h4 id="orgfa11d10">Linux</h4>
<div class="outline-text-4" id="text-orgfa11d10">
<div class="org-src-container">
<pre class="src src-shell">apt-get install git-flow
</pre>
</div>
</div>
</div>

<div id="outline-container-org97344e4" class="outline-4">
<h4 id="org97344e4">Windows (Cygwin)</h4>
<div class="outline-text-4" id="text-org97344e4">
<p>
安装 git-flow, 你需要 wget 和 util-linux。
</p>

<div class="org-src-container">
<pre class="src src-shell">wget -q -O - --no-check-certificate https://github.com/nvie/gitflow/raw/develop/contrib/gitflow-installer.sh | bash
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfcdff03" class="outline-3">
<h3 id="orgfcdff03">开始</h3>
<div class="outline-text-3" id="text-orgfcdff03">
<ul class="org-ul">
<li>为了自定义你的项目，Git flow 需要初始化过程。</li>
<li>使用 git-flow，从初始化一个现有的 git 库内开始。</li>
</ul>
</div>

<div id="outline-container-org92e1d1e" class="outline-4">
<h4 id="org92e1d1e">创建本地新的 dev 分支</h4>
<div class="outline-text-4" id="text-org92e1d1e">
<div class="org-src-container">
<pre class="src src-shell">git branch dev  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21019;&#24314;&#26412;&#22320;&#20998;&#25903;</span>
git branch  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26597;&#30475;&#20998;&#25903;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#36825;&#26159;&#20250;&#30475;&#21040; master &#21644; dev&#65292;&#32780;&#19988; master &#19978;&#20250;&#26377;&#19968;&#20010;&#26143;&#21495;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#36825;&#20010;&#26102;&#20505; dev &#26159;&#19968;&#20010;&#26412;&#22320;&#20998;&#25903;&#65292;&#36828;&#31243;&#20179;&#24211;&#19981;&#30693;&#36947;&#23427;&#30340;&#23384;&#22312;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26412;&#22320;&#20998;&#25903;&#21487;&#20197;&#19981;&#21516;&#27493;&#21040;&#36828;&#31243;&#20179;&#24211;&#65292;&#25105;&#20204;&#21487;&#20197;&#22312; dev &#24320;&#21457;&#65292;&#28982;&#21518; merge &#21040; master&#65292;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#20351;&#29992; master &#21516;&#27493;&#20195;&#30721;&#65292;&#24403;&#28982;&#20063;&#21487;&#20197;&#21516;&#27493;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc91b32d" class="outline-4">
<h4 id="orgc91b32d">发布 dev 分支</h4>
<div class="outline-text-4" id="text-orgc91b32d">
<p>
发布 dev 分支指的是同步 dev 分支的代码到远程服务器
</p>

<div class="org-src-container">
<pre class="src src-shell">git push origin dev:dev  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#36825;&#26679;&#36828;&#31243;&#20179;&#24211;&#20063;&#26377;&#19968;&#20010; dev &#20998;&#25903;&#20102;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga74a0dd" class="outline-4">
<h4 id="orga74a0dd">在 dev 分支开发代码</h4>
<div class="outline-text-4" id="text-orga74a0dd">
<div class="org-src-container">
<pre class="src src-shell">git checkout dev  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#20999;&#25442;&#21040; dev &#20998;&#25903;&#36827;&#34892;&#24320;&#21457;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#24320;&#21457;&#20195;&#30721;&#20043;&#21518;&#65292;&#25105;&#20204;&#26377;&#20004;&#20010;&#36873;&#25321;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#31532;&#19968;&#20010;&#65306;&#22914;&#26524;&#21151;&#33021;&#24320;&#21457;&#23436;&#25104;&#20102;&#65292;&#21487;&#20197;&#21512;&#24182;&#20027;&#20998;&#25903;</span>
git checkout master  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#20999;&#25442;&#21040;&#20027;&#20998;&#25903;</span>
git merge dev  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#25226; dev &#20998;&#25903;&#30340;&#26356;&#25913;&#21644; master &#21512;&#24182;</span>
git push  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#25552;&#20132;&#20027;&#20998;&#25903;&#20195;&#30721;&#36828;&#31243;</span>
git checkout dev  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#20999;&#25442;&#21040; dev &#36828;&#31243;&#20998;&#25903;</span>
git push  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#25552;&#20132; dev &#20998;&#25903;&#21040;&#36828;&#31243;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#31532;&#20108;&#20010;&#65306;&#22914;&#26524;&#21151;&#33021;&#27809;&#26377;&#23436;&#25104;&#65292;&#21487;&#20197;&#30452;&#25509;&#25512;&#36865;</span>
git push  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#25552;&#20132;&#21040; dev &#36828;&#31243;&#20998;&#25903;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#27880;&#24847;&#65306;&#22312;&#20998;&#25903;&#20999;&#25442;&#20043;&#21069;&#26368;&#22909;&#20808; commit &#20840;&#37096;&#30340;&#25913;&#21464;&#65292;&#38500;&#38750;&#20320;&#30495;&#30340;&#30693;&#36947;&#33258;&#24049;&#22312;&#20570;&#20160;&#20040;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgde92829" class="outline-4">
<h4 id="orgde92829">删除分支</h4>
<div class="outline-text-4" id="text-orgde92829">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21024;&#38500;&#36828;&#31243; dev &#20998;&#25903;&#65292;&#21361;&#38505;&#21629;&#20196;&#21734;</span>
git push origin --delete &lt;branchName&gt;
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21487;&#20197;&#20351;&#29992;&#36825;&#31181;&#35821;&#27861;&#65292;&#25512;&#36865;&#19968;&#20010;&#31354;&#20998;&#25903;&#21040;&#36828;&#31243;&#20998;&#25903;&#65292;&#20854;&#23454;&#23601;&#30456;&#24403;&#20110;&#21024;&#38500;&#36828;&#31243;&#20998;&#25903;</span>
git push origin :dev
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#19979;&#38754;&#20004;&#26465;&#26159;&#21024;&#38500;&#26412;&#22320;&#20998;&#25903;</span>
git checkout master  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#20999;&#25442;&#21040; master &#20998;&#25903;</span>
git branch -d dev  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21024;&#38500;&#26412;&#22320; dev &#20998;&#25903;</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf5b3fda" class="outline-3">
<h3 id="orgf5b3fda">追踪分支</h3>
<div class="outline-text-3" id="text-orgf5b3fda">
<p>
追踪分支是用与联系本地分支和远程分支的. 如果你在追踪分支(Tracking Branches)上执行推送(push)或拉取(pull)时,　它会自动推送(push)或拉取(pull)到关联的远程分支上。
</p>

<p>
如果你经常要从远程仓库里拉取(pull)分支到本地,并且不想很麻烦的使用 `git pull` 这种格式; 那么就应当使用追踪分支(Tracking Branches)。
</p>

<p>
`git clone` 命令会自动在本地建立一个 master 分支，它是 origin/master 的追踪分支。 而 origin/master 就是被克隆(clone)仓库的'master'分支。
</p>

<p>
译者注: origin 一般是指原始仓库地址的别名。
</p>

<p>
可以在使用 `git branch` 命令时加上 `&#x2013;track` 参数, 来手动创建一个追踪分支。
</p>

<div class="org-src-container">
<pre class="src src-shell">git branch --track experimental origin/experimental
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#25110;&#32773;</span>
git checkout --track origin/experimental
</pre>
</div>

<p>
当你运行下命令时:
</p>

<div class="org-src-container">
<pre class="src src-shell">git pull experimental
</pre>
</div>

<p>
它会自动从 `origin` 抓取(fetch)内容，再把远程的 `origin/experimental` 分支合并进(merge)本地的 experimental 分支。
</p>

<p>
当要把修改推送(push)到 origin 时, 它会将你本地的 experimental 分支中的修改推送到 origin 的 experimental 分支里,　而无需指定它(origin)。
</p>
</div>
</div>
</div>


<div id="outline-container-orga14ad0d" class="outline-2">
<h2 id="orga14ad0d">Tips</h2>
<div class="outline-text-2" id="text-orga14ad0d">
</div>
<div id="outline-container-org7d28bb4" class="outline-3">
<h3 id="org7d28bb4">查看某文件的修改历史 **</h3>
<div class="outline-text-3" id="text-org7d28bb4">
<p>
先进入此文件所在的目录下
</p>

<ol class="org-ol">
<li>查看 fileName 相关的 commit 记录：`git log filename`</li>
<li>显示每次提交的 diff：`git log -p filename`</li>
<li>查看某次提交中的某个文件变化，可以直接加上 fileName：`git show commit-id filename`</li>
<li>根据 commit-id 查看某个提交：`git show -s &#x2013;pretty=raw ca53e82`</li>
</ol>
</div>
</div>
