_org/_posts/devenv/2018-07-12-git.org
** git log 的常用选项

   | 选项             | 说明                                                              |
   |------------------+-------------------------------------------------------------------|
   | -p               | 按补丁格式显示每个更新之间的差异。                                |
   | --stat           | 显示每次更新的文件修改统计信息。                                  |
   | --shortstat      | 只显示 –stat 中最后的行数修改添加移除统计。                       |
   | --name-only      | 仅在提交信息后显示已修改的文件清单。                              |
   | --name-status    | 显示新增、修改、删除的文件清单。                                  |
   | --abbrev-commit  | 仅显示 SHA-1 的前几个字符，而非所有的 40 个字符。                 |
   | --relative-date  | 使用较短的相对时间显示（比如，“2 weeks ago”）。                   |
   | --graph          | 显示 ASCII 图形表示的分支合并历史。                               |
   | --pretty         | 使用其他格式显示历史提交信息。                                    |
   |                  | 可用选项 oneline，short，full，fuller 和 format（后跟指定格式）。 |
   | -(n)             | 仅显示最近的 n 条提交                                             |
   | --since,--after  | 仅显示指定时间之后的提交。                                        |
   | --until,--before | 仅显示指定时间之前的提交。                                        |
   | --author         | 仅显示指定作者相关的提交。                                        |
   | --committer      | 仅显示指定提交者相关的提交。                                      |
   | --grep           | 仅显示含指定关键字的提交                                          |
   | -S               | 仅显示添加或移除了某个关键字的提交                                |


* References

  #+begin_quote
  本文是我的学习笔记，内容参考了网上资源，为了方便自己查询使用，做了一些修改整理。

  笔记内容摘录于下列文章，相应权利归属原作者，如有未列出的或有不妥，请联系我立即增补或删除。

  - <https://github.com/arslanbilal/git-cheat-sheet/blob/master/other-sheets/git-cheat-sheet-zh.md>
  #+end_quote
