_posts/devenv/2018-07-12-git.html

<div id="outline-container-org6ffd51f" class="outline-3">
<h3 id="org6ffd51f">git log 的常用选项</h3>
<div class="outline-text-3" id="text-org6ffd51f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">选项</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">-p</td>
<td class="org-left">按补丁格式显示每个更新之间的差异。</td>
</tr>

<tr>
<td class="org-left">&#x2013;stat</td>
<td class="org-left">显示每次更新的文件修改统计信息。</td>
</tr>

<tr>
<td class="org-left">&#x2013;shortstat</td>
<td class="org-left">只显示 –stat 中最后的行数修改添加移除统计。</td>
</tr>

<tr>
<td class="org-left">&#x2013;name-only</td>
<td class="org-left">仅在提交信息后显示已修改的文件清单。</td>
</tr>

<tr>
<td class="org-left">&#x2013;name-status</td>
<td class="org-left">显示新增、修改、删除的文件清单。</td>
</tr>

<tr>
<td class="org-left">&#x2013;abbrev-commit</td>
<td class="org-left">仅显示 SHA-1 的前几个字符，而非所有的 40 个字符。</td>
</tr>

<tr>
<td class="org-left">&#x2013;relative-date</td>
<td class="org-left">使用较短的相对时间显示（比如，“2 weeks ago”）。</td>
</tr>

<tr>
<td class="org-left">&#x2013;graph</td>
<td class="org-left">显示 ASCII 图形表示的分支合并历史。</td>
</tr>

<tr>
<td class="org-left">&#x2013;pretty</td>
<td class="org-left">使用其他格式显示历史提交信息。</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">可用选项 oneline，short，full，fuller 和 format（后跟指定格式）。</td>
</tr>

<tr>
<td class="org-left">-(n)</td>
<td class="org-left">仅显示最近的 n 条提交</td>
</tr>

<tr>
<td class="org-left">&#x2013;since,&#x2013;after</td>
<td class="org-left">仅显示指定时间之后的提交。</td>
</tr>

<tr>
<td class="org-left">&#x2013;until,&#x2013;before</td>
<td class="org-left">仅显示指定时间之前的提交。</td>
</tr>

<tr>
<td class="org-left">&#x2013;author</td>
<td class="org-left">仅显示指定作者相关的提交。</td>
</tr>

<tr>
<td class="org-left">&#x2013;committer</td>
<td class="org-left">仅显示指定提交者相关的提交。</td>
</tr>

<tr>
<td class="org-left">&#x2013;grep</td>
<td class="org-left">仅显示含指定关键字的提交</td>
</tr>

<tr>
<td class="org-left">-S</td>
<td class="org-left">仅显示添加或移除了某个关键字的提交</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>


<div id="outline-container-org2ab0085" class="outline-2">
<h2 id="org2ab0085">References</h2>
<div class="outline-text-2" id="text-org2ab0085">
<blockquote>
<p>
本文是我的学习笔记，内容参考了网上资源，为了方便自己查询使用，做了一些修改整理。
</p>

<p>
笔记内容摘录于下列文章，相应权利归属原作者，如有未列出的或有不妥，请联系我立即增补或删除。
</p>

<ul class="org-ul">
<li><a href="https://github.com/arslanbilal/git-cheat-sheet/blob/master/other-sheets/git-cheat-sheet-zh.md">https://github.com/arslanbilal/git-cheat-sheet/blob/master/other-sheets/git-cheat-sheet-zh.md</a></li>
</ul>
</blockquote>
</div>
</div>
